================================================================================
DecimalPlaces property with simple format
================================================================================

page 50100 "Test Page"
{
    layout
    {
        area(content)
        {
            field(Amount; Amount)
            {
                DecimalPlaces = 2;
            }
        }
    }
}

--------------------------------------------------------------------------------

(source_file
  (page_declaration
    object_id: (integer)
    object_name: (quoted_identifier)
    (layout_section
      (area_section
        (field_section
          control_id: (identifier)
          source_or_field_name: (identifier)
          (decimal_places_property
            value: (integer)))))))

================================================================================
DecimalPlaces property with precision and scale
================================================================================

page 50100 "Test Page"
{
    layout
    {
        area(content)
        {
            field(Amount; Amount)
            {
                DecimalPlaces = 2:5;
            }
        }
    }
}

--------------------------------------------------------------------------------

(source_file
  (page_declaration
    object_id: (integer)
    object_name: (quoted_identifier)
    (layout_section
      (area_section
        (field_section
          control_id: (identifier)
          source_or_field_name: (identifier)
          (decimal_places_property
            precision: (integer)
            scale: (integer)))))))

================================================================================
DecimalPlaces property with precision only (edge case)
================================================================================

page 50100 "Test Page"
{
    layout
    {
        area(content)
        {
            field("From Value"; Rec."From Value")
            {
                DecimalPlaces = 0 :;
            }
        }
    }
}

--------------------------------------------------------------------------------

(source_file
  (page_declaration
    object_id: (integer)
    object_name: (quoted_identifier)
    (layout_section
      (area_section
        (field_section
          control_id: (quoted_identifier)
          source_or_field_name: (field_access
            record: (identifier)
            field: (quoted_identifier))
          (decimal_places_property
            precision: (integer)))))))

================================================================================
Multiple fields with different DecimalPlaces formats
================================================================================

page 50100 "Test Page"
{
    layout
    {
        area(content)
        {
            field(SimpleFormat; Value1)
            {
                DecimalPlaces = 3;
            }
            field(PrecisionScale; Value2)
            {
                DecimalPlaces = 1:2;
            }
            field(EdgeCase; Value3)
            {
                DecimalPlaces = 0 :;
            }
        }
    }
}

--------------------------------------------------------------------------------

(source_file
  (page_declaration
    object_id: (integer)
    object_name: (quoted_identifier)
    (layout_section
      (area_section
        (field_section
          control_id: (identifier)
          source_or_field_name: (identifier)
          (decimal_places_property
            value: (integer)))
        (field_section
          control_id: (identifier)
          source_or_field_name: (identifier)
          (decimal_places_property
            precision: (integer)
            scale: (integer)))
        (field_section
          control_id: (identifier)
          source_or_field_name: (identifier)
          (decimal_places_property
            precision: (integer)))))))