================================================================================
Standalone semicolon in part section
================================================================================

pageextension 50100 "Test Page Extension" extends "Customer Card"
{
    layout
    {
        addafter(General)
        {
            part(TestPart; "Test Page")
            {
                ApplicationArea = All;
                Visible = true;
                ;
            }
        }
    }
}

--------------------------------------------------------------------------------

(source_file
  (pageextension_declaration
    object_id: (integer)
    object_name: (quoted_identifier)
    base_object: (quoted_identifier)
    (layout_section
      (addafter_layout_modification
        target: (identifier)
        (part_section
          name: (identifier)
          page_name: (quoted_identifier)
          (application_area_property
            value: (identifier))
          (visible_property
            value: (boolean))
          (empty_statement))))))

================================================================================
Standalone semicolon in action block
================================================================================

page 50100 "Test Page"
{
    actions
    {
        action(TestAction)
        {
            ApplicationArea = All;
            Caption = 'Test';
            ;
            trigger OnAction()
            begin
                Message('Test');
            end;
        }
    }
}

--------------------------------------------------------------------------------

(source_file
  (page_declaration
    object_id: (integer)
    object_name: (quoted_identifier)
    (actions_section
      (action_declaration
        name: (identifier)
        (application_area_property
          value: (identifier))
        (caption_property
          (string_literal))
        (trigger_declaration
          name: (trigger_name)
          (parameter_list)
          (code_block
            (call_expression
              function: (identifier)
              arguments: (argument_list
                (string_literal)))
            (block_end)))))))

================================================================================
Multiple standalone semicolons in action
================================================================================

page 50100 "Test Page"
{
    actions
    {
        action(TestAction)
        {
            ;
            ApplicationArea = All;
            ;
            ;
            Caption = 'Test';
            ;
        }
    }
}

--------------------------------------------------------------------------------

(source_file
  (page_declaration
    object_id: (integer)
    object_name: (quoted_identifier)
    (actions_section
      (action_declaration
        name: (identifier)
        (application_area_property
          value: (identifier))
        (caption_property
          (string_literal))))))

================================================================================
Standalone semicolon in systempart
================================================================================

page 50100 "Test Page"
{
    layout
    {
        area(FactBoxes)
        {
            systempart(Links; Links)
            {
                ApplicationArea = All;
                ;
            }
        }
    }
}

--------------------------------------------------------------------------------

(source_file
  (page_declaration
    object_id: (integer)
    object_name: (quoted_identifier)
    (layout_section
      (area_section
        (systempart_section
          control_id: (identifier)
          systempart_type: (identifier)
          (application_area_property
            value: (identifier))
          (empty_statement))))))

================================================================================
Standalone semicolon in action group
================================================================================

page 50100 "Test Page"
{
    actions
    {
        area(Processing)
        {
            group(TestGroup)
            {
                Caption = 'Test Group';
                ;
                action(TestAction)
                {
                    ApplicationArea = All;
                    ;
                }
            }
        }
    }
}

--------------------------------------------------------------------------------

(source_file
  (page_declaration
    object_id: (integer)
    object_name: (quoted_identifier)
    (actions_section
      (area_action_section
        (action_group_section
          name: (identifier)
          (caption_property
            (string_literal))
          (empty_statement)
          (action_declaration
            name: (identifier)
            (application_area_property
              value: (identifier))))))))

================================================================================
Standalone semicolon at beginning of properties
================================================================================

page 50100 "Test Page"
{
    PageType = Card;
    actions
    {
        action(TestAction)
        {
            ;
            ApplicationArea = All;
        }
    }
}

--------------------------------------------------------------------------------

(source_file
  (page_declaration
    object_id: (integer)
    object_name: (quoted_identifier)
    (page_type_property)
    (actions_section
      (action_declaration
        name: (identifier)
        (application_area_property
          value: (identifier))))))

================================================================================
Standalone semicolon in modify action
================================================================================

pageextension 50100 "Test Extension" extends "Customer List"
{
    actions
    {
        modify(NewCustomer)
        {
            Visible = false;
            ;
        }
    }
}

--------------------------------------------------------------------------------

(source_file
  (pageextension_declaration
    object_id: (integer)
    object_name: (quoted_identifier)
    base_object: (quoted_identifier)
    (actions_section
      (modify_action
        target: (identifier)
        (visible_property
          value: (boolean))))))
