================================================================================
NonDebuggable attribute on variable
================================================================================

page 50100 "Test Page"
{
    var
        UserName: Text;
        [NonDebuggable]
        PasswordText: Text;

    procedure Test()
    begin
    end;
}

--------------------------------------------------------------------------------

(source_file
  (page_declaration
    (integer)
    (quoted_identifier)
    (var_section
      (variable_declaration
        (identifier)
        (type_specification
          (text_type)))
      (attribute_item
        (attribute_content
          (identifier)))
      (variable_declaration
        (identifier)
        (type_specification
          (text_type))))
    (procedure
      (name
        (identifier))
      (code_block
        (block_end)))))

================================================================================
RunOnClient attribute on DotNet variable
================================================================================

codeunit 50100 "Test DotNet"
{
    var
        TempRecord: Record "Test" temporary;
        [RunOnClient]
        OfficeHost: DotNet OfficeHost;
        IsInitialized: Boolean;

    procedure Test()
    begin
    end;
}

--------------------------------------------------------------------------------

(source_file
  (codeunit_declaration
    (integer)
    (quoted_identifier)
    (var_section
      (variable_declaration
        (identifier)
        (type_specification
          (record_type
            (quoted_identifier)))
        (temporary))
      (attribute_item
        (attribute_content
          (identifier)))
      (variable_declaration
        (identifier)
        (type_specification
          (dotnet_type
            (dotnet_type_name))))
      (variable_declaration
        (identifier)
        (type_specification
          (basic_type))))
    (procedure
      (name
        (identifier))
      (code_block
        (block_end)))))

================================================================================
Multiple attributes on variable
================================================================================

page 50101 "Test Multiple Attrs"
{
    var
        [RunOnClient]
        [WithEvents]
        PageNotifier: DotNet PageNotifier;
        ShowActivities: Boolean;

    procedure Test()
    begin
    end;
}

--------------------------------------------------------------------------------

(source_file
  (page_declaration
    (integer)
    (quoted_identifier)
    (var_section
      (attribute_item
        (attribute_content
          (identifier)))
      (attribute_item
        (attribute_content
          (identifier)))
      (variable_declaration
        (identifier)
        (type_specification
          (dotnet_type
            (dotnet_type_name))))
      (variable_declaration
        (identifier)
        (type_specification
          (basic_type))))
    (procedure
      (name
        (identifier))
      (code_block
        (block_end)))))

================================================================================
NonDebuggable in local var section
================================================================================

codeunit 50102 "Test Local Attr"
{
    procedure Login()
    var
        Username: Text;
        [NonDebuggable]
        Password: Text;
    begin
    end;
}

--------------------------------------------------------------------------------

(source_file
  (codeunit_declaration
    (integer)
    (quoted_identifier)
    (procedure
      (name
        (identifier))
      (var_section
        (variable_declaration
          (identifier)
          (type_specification
            (text_type)))
        (attribute_item
          (attribute_content
            (identifier)))
        (variable_declaration
          (identifier)
          (type_specification
            (text_type))))
      (code_block
        (block_end)))))

================================================================================
InDataSet attribute on variable
================================================================================

page 50103 "Test InDataSet"
{
    var
        [InDataSet]
        StyleEnabled: Boolean;
        Counter: Integer;

    procedure Test()
    begin
    end;
}

--------------------------------------------------------------------------------

(source_file
  (page_declaration
    (integer)
    (quoted_identifier)
    (var_section
      (attribute_item
        (attribute_content
          (identifier)))
      (variable_declaration
        (identifier)
        (type_specification
          (basic_type)))
      (variable_declaration
        (identifier)
        (type_specification
          (basic_type))))
    (procedure
      (name
        (identifier))
      (code_block
        (block_end)))))
